Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_bf.h
/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENA_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN_OFF (0u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENB_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENB_W_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENB_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENB_W_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENB_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENB_W_EN_OFF (0u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENA_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENA_R_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENA_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENA_R_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENA_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENA_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNLA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNLA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNLA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNLA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNLA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNLA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNUA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNUA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNUA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNUA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNUA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNUA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN_OFF (0u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_W_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_W_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_W_EN_OFF (0u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_OSEL_Bits.SHOVEN_x */
#define IFX_CPU_OSEL_SHOVEN_X_LEN (32u)

/** \brief Mask for Ifx_CPU_OSEL_Bits.SHOVEN_x */
#define IFX_CPU_OSEL_SHOVEN_X_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_OSEL_Bits.SHOVEN_x */
#define IFX_CPU_OSEL_SHOVEN_X_OFF (0u)

/** \brief Length for Ifx_CPU_BLK_RABR_Bits.OBASE */
#define IFX_CPU_BLK_RABR_OBASE_LEN (17u)

/** \brief Mask for Ifx_CPU_BLK_RABR_Bits.OBASE */
#define IFX_CPU_BLK_RABR_OBASE_MSK (0x1ffffu)

/** \brief Offset for Ifx_CPU_BLK_RABR_Bits.OBASE */
#define IFX_CPU_BLK_RABR_OBASE_OFF (5u)

/** \brief Length for Ifx_CPU_BLK_RABR_Bits.OMEM */
#define IFX_CPU_BLK_RABR_OMEM_LEN (4u)

/** \brief Mask for Ifx_CPU_BLK_RABR_Bits.OMEM */
#define IFX_CPU_BLK_RABR_OMEM_MSK (0xfu)

/** \brief Offset for Ifx_CPU_BLK_RABR_Bits.OMEM */
#define IFX_CPU_BLK_RABR_OMEM_OFF (24u)

/** \brief Length for Ifx_CPU_BLK_RABR_Bits.OVEN */
#define IFX_CPU_BLK_RABR_OVEN_LEN (1u)

/** \brief Mask for Ifx_CPU_BLK_RABR_Bits.OVEN */
#define IFX_CPU_BLK_RABR_OVEN_MSK (0x1u)

/** \brief Offset for Ifx_CPU_BLK_RABR_Bits.OVEN */
#define IFX_CPU_BLK_RABR_OVEN_OFF (31u)

/** \brief Length for Ifx_CPU_BLK_OTAR_Bits.TBASE */
#define IFX_CPU_BLK_OTAR_TBASE_LEN (23u)

/** \brief Mask for Ifx_CPU_BLK_OTAR_Bits.TBASE */
#define IFX_CPU_BLK_OTAR_TBASE_MSK (0x7fffffu)

/** \brief Offset for Ifx_CPU_BLK_OTAR_Bits.TBASE */
#define IFX_CPU_BLK_OTAR_TBASE_OFF (5u)

/** \brief Length for Ifx_CPU_BLK_OMASK_Bits.OMASK */
#define IFX_CPU_BLK_OMASK_OMASK_LEN (12u)

/** \brief Mask for Ifx_CPU_BLK_OMASK_Bits.OMASK */
#define IFX_CPU_BLK_OMASK_OMASK_MSK (0xfffu)

/** \brief Offset for Ifx_CPU_BLK_OMASK_Bits.OMASK */
#define IFX_CPU_BLK_OMASK_OMASK_OFF (5u)

/** \brief Length for Ifx_CPU_BLK_OMASK_Bits.ONE */
#define IFX_CPU_BLK_OMASK_ONE_LEN (11u)

/** \brief Mask for Ifx_CPU_BLK_OMASK_Bits.ONE */
#define IFX_CPU_BLK_OMASK_ONE_MSK (0x7ffu)

/** \brief Offset for Ifx_CPU_BLK_OMASK_Bits.ONE */
#define IFX_CPU_BLK_OMASK_ONE_OFF (17u)

/** \brief Length for Ifx_CPU_SEGEN_Bits.ADFLIP */
#define IFX_CPU_SEGEN_ADFLIP_LEN (8u)

/** \brief Mask for Ifx_CPU_SEGEN_Bits.ADFLIP */
#define IFX_CPU_SEGEN_ADFLIP_MSK (0xffu)

