Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCpu_bf.h
/** \brief Offset for Ifx_CPU_TPS_CON_Bits.TEXP1 */
#define IFX_CPU_TPS_CON_TEXP1_OFF (1u)

/** \brief Length for Ifx_CPU_TPS_CON_Bits.TEXP2 */
#define IFX_CPU_TPS_CON_TEXP2_LEN (1u)

/** \brief Mask for Ifx_CPU_TPS_CON_Bits.TEXP2 */
#define IFX_CPU_TPS_CON_TEXP2_MSK (0x1u)

/** \brief Offset for Ifx_CPU_TPS_CON_Bits.TEXP2 */
#define IFX_CPU_TPS_CON_TEXP2_OFF (2u)

/** \brief Length for Ifx_CPU_TPS_CON_Bits.TTRAP */
#define IFX_CPU_TPS_CON_TTRAP_LEN (1u)

/** \brief Mask for Ifx_CPU_TPS_CON_Bits.TTRAP */
#define IFX_CPU_TPS_CON_TTRAP_MSK (0x1u)

/** \brief Offset for Ifx_CPU_TPS_CON_Bits.TTRAP */
#define IFX_CPU_TPS_CON_TTRAP_OFF (16u)

/** \brief Length for Ifx_CPU_TPS_TIMER_Bits.Timer */
#define IFX_CPU_TPS_TIMER_TIMER_LEN (32u)

/** \brief Mask for Ifx_CPU_TPS_TIMER_Bits.Timer */
#define IFX_CPU_TPS_TIMER_TIMER_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_TPS_TIMER_Bits.Timer */
#define IFX_CPU_TPS_TIMER_TIMER_OFF (0u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_ENTRY_LVAL_Bits.ENTRY_LVAL */
#define IFX_CPU_TPS_EXTIM_ENTRY_LVAL_ENTRY_LVAL_LEN (8u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_ENTRY_LVAL_Bits.ENTRY_LVAL */
#define IFX_CPU_TPS_EXTIM_ENTRY_LVAL_ENTRY_LVAL_MSK (0xffu)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_ENTRY_LVAL_Bits.ENTRY_LVAL */
#define IFX_CPU_TPS_EXTIM_ENTRY_LVAL_ENTRY_LVAL_OFF (4u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_ENTRY_CVAL_Bits.ENTRY_CVAL */
#define IFX_CPU_TPS_EXTIM_ENTRY_CVAL_ENTRY_CVAL_LEN (12u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_ENTRY_CVAL_Bits.ENTRY_CVAL */
#define IFX_CPU_TPS_EXTIM_ENTRY_CVAL_ENTRY_CVAL_MSK (0xfffu)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_ENTRY_CVAL_Bits.ENTRY_CVAL */
#define IFX_CPU_TPS_EXTIM_ENTRY_CVAL_ENTRY_CVAL_OFF (0u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_EXIT_LVAL_Bits.EXIT_LVAL */
#define IFX_CPU_TPS_EXTIM_EXIT_LVAL_EXIT_LVAL_LEN (20u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_EXIT_LVAL_Bits.EXIT_LVAL */
#define IFX_CPU_TPS_EXTIM_EXIT_LVAL_EXIT_LVAL_MSK (0xfffffu)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_EXIT_LVAL_Bits.EXIT_LVAL */
#define IFX_CPU_TPS_EXTIM_EXIT_LVAL_EXIT_LVAL_OFF (4u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_EXIT_CVAL_Bits.EXIT_CVAL */
#define IFX_CPU_TPS_EXTIM_EXIT_CVAL_EXIT_CVAL_LEN (24u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_EXIT_CVAL_Bits.EXIT_CVAL */
#define IFX_CPU_TPS_EXTIM_EXIT_CVAL_EXIT_CVAL_MSK (0xffffffu)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_EXIT_CVAL_Bits.EXIT_CVAL */
#define IFX_CPU_TPS_EXTIM_EXIT_CVAL_EXIT_CVAL_OFF (0u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_CLASS_EN_Bits.EXTIM_CLASS_EN */
#define IFX_CPU_TPS_EXTIM_CLASS_EN_EXTIM_CLASS_EN_LEN (8u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_CLASS_EN_Bits.EXTIM_CLASS_EN */
#define IFX_CPU_TPS_EXTIM_CLASS_EN_EXTIM_CLASS_EN_MSK (0xffu)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_CLASS_EN_Bits.EXTIM_CLASS_EN */
#define IFX_CPU_TPS_EXTIM_CLASS_EN_EXTIM_CLASS_EN_OFF (0u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_TIN_LEN (8u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_TIN_MSK (0xffu)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_TIN_OFF (0u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_CLASS_LEN (3u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_CLASS_MSK (0x7u)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_CLASS_OFF (8u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_AT */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_AT_LEN (1u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_AT */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_AT_MSK (0x1u)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.EXIT_AT */
#define IFX_CPU_TPS_EXTIM_STAT_EXIT_AT_OFF (15u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_TIN_LEN (8u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_TIN_MSK (0xffu)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_TIN */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_TIN_OFF (16u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_CLASS_LEN (3u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_CLASS_MSK (0x7u)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_CLASS */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_CLASS_OFF (24u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_AT */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_AT_LEN (1u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_AT */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_AT_MSK (0x1u)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_STAT_Bits.ENTRY_AT */
#define IFX_CPU_TPS_EXTIM_STAT_ENTRY_AT_OFF (31u)

/** \brief Length for Ifx_CPU_TPS_EXTIM_FCX_Bits.EXIT_FCX */
#define IFX_CPU_TPS_EXTIM_FCX_EXIT_FCX_LEN (20u)

/** \brief Mask for Ifx_CPU_TPS_EXTIM_FCX_Bits.EXIT_FCX */
#define IFX_CPU_TPS_EXTIM_FCX_EXIT_FCX_MSK (0xfffffu)

/** \brief Offset for Ifx_CPU_TPS_EXTIM_FCX_Bits.EXIT_FCX */
#define IFX_CPU_TPS_EXTIM_FCX_EXIT_FCX_OFF (0u)

/** \brief Length for Ifx_CPU_TR_EVT_Bits.EVTA */
#define IFX_CPU_TR_EVT_EVTA_LEN (3u)

/** \brief Mask for Ifx_CPU_TR_EVT_Bits.EVTA */
#define IFX_CPU_TR_EVT_EVTA_MSK (0x7u)

/** \brief Offset for Ifx_CPU_TR_EVT_Bits.EVTA */
#define IFX_CPU_TR_EVT_EVTA_OFF (0u)

/** \brief Length for Ifx_CPU_TR_EVT_Bits.BBM */
#define IFX_CPU_TR_EVT_BBM_LEN (1u)

/** \brief Mask for Ifx_CPU_TR_EVT_Bits.BBM */
#define IFX_CPU_TR_EVT_BBM_MSK (0x1u)

/** \brief Offset for Ifx_CPU_TR_EVT_Bits.BBM */
#define IFX_CPU_TR_EVT_BBM_OFF (3u)

/** \brief Length for Ifx_CPU_TR_EVT_Bits.BOD */
#define IFX_CPU_TR_EVT_BOD_LEN (1u)

/** \brief Mask for Ifx_CPU_TR_EVT_Bits.BOD */
#define IFX_CPU_TR_EVT_BOD_MSK (0x1u)

/** \brief Offset for Ifx_CPU_TR_EVT_Bits.BOD */
#define IFX_CPU_TR_EVT_BOD_OFF (4u)

/** \brief Length for Ifx_CPU_TR_EVT_Bits.SUSP */
#define IFX_CPU_TR_EVT_SUSP_LEN (1u)

/** \brief Mask for Ifx_CPU_TR_EVT_Bits.SUSP */
#define IFX_CPU_TR_EVT_SUSP_MSK (0x1u)

/** \brief Offset for Ifx_CPU_TR_EVT_Bits.SUSP */
#define IFX_CPU_TR_EVT_SUSP_OFF (5u)

/** \brief Length for Ifx_CPU_TR_EVT_Bits.CNT */
#define IFX_CPU_TR_EVT_CNT_LEN (2u)

/** \brief Mask for Ifx_CPU_TR_EVT_Bits.CNT */
#define IFX_CPU_TR_EVT_CNT_MSK (0x3u)

